{
  "hadiths": [
    {
      "id": 0,
      "name": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, “যে ব্যাক্তি জ্ঞানার্জনের জন্য কোন পথে চলে, আল্লাহ্‌ তার জন্য জান্নাতের পথ সহজ করে দেন।” ",
      "numbers": "মুসলিম ২৬৯৯",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": 1,
      "name": "আবূ মুসা আশা’আরী (রাঃ) থেকে বর্ণিতঃ",
      "description": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, “তিনবার অনুমতি চাইবে। অনুমতি দিলে প্রবেশ করবে, অন্যথায় ফিরে যাবে।” ",
      "numbers": "বুখারী ৬২৪৫, মুসলিম ২১৫৩",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "2",
      "name": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর আযাদকৃত গোলাম সাওবান (রাঃ) থেকে বর্ণিতঃ",
      "description": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর আযাদকৃত গোলাম সাওবান (রাঃ) রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণনা করেছেন। তিনি বলেছেন, “যে ব্যক্তি কোন রোগীকে দেখতে যায়, সে জান্নাতের ফলমূলে অবস্থান করতে থাকে।” জিজ্ঞেস করা হলো, জান্নাতের ফলমূলে অবস্থান করা কি? তিনি বললেন, “এর ফলমূল সংগ্রহ করা।” ",
      "numbers": "মুসলিম ২৫৬৮",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "3",
      "name": "আনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, (লোকেদের) সলাতের সময় জানানোর উদ্দেশে একটা কিছু নির্দিষ্ট করার জন্যে সহাবাগণ পরস্পর আলোচনা করলেন। তাঁরা বললেন, আগুন জ্বালানো হোক অথবা নাকূস (ঘন্টা) বাজানো হোক। বিলালকে আযানের শব্দগুলো দু’বার এবং ইকামাতের শব্দগুলো একবার করে উচ্চারণ করার নির্দেশ দেয়া হল। ",
      "numbers": "ই. ফা. ৭২৩, ই. সে. ৭৩৮",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "4",
      "name": "আনাস (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, বিলাল (রাঃ)-কে আযান জোড় সংখ্যায় এবং ইকামাত বেজোড় সংখ্যায় বলার নির্দেশ দেয়া হয়েছে। ",
      "numbers": "ই. ফা. ৭২৫, ই. সে. ৭৪০",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "5",
      "name": "ইবনু ‘উমার (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর দু’জন মুওয়ায্‌যিন ছিলঃ বিলাল (রাঃ) এবং অন্ধ ‘আবদুল্লাহ ইবনু উম্মু মাকতূম (রাঃ)। ",
      "numbers": "ই. ফা. ৭২৭, ই. সে. ৭৪২",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "6",
      "name": "‘আয়িশাহ্ (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, ইবনু মাকতূম (রাঃ) রসূল্ললাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সম্মতিতে আযান দিতেন। তখন তিনি ছিলেন অন্ধ। ",
      "numbers": "ই. ফা. ৭২৯, ই. সে. ৭৪৪",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "7",
      "name": "আবূ সা’ঈদ আল খুদরী (রাঃ) থেকে বর্ণিতঃ",
      "description": "রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ যখন তোমরা আযান শুনতে পাও তখন মুওয়ায্‌যিন যা বলে তোমরা তাই-ই বল। ",
      "numbers": "ই. ফা. ৭৩২, ই. সে. ৭৪৭",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "8",
      "name": "আবদুল্লাহ ইবনু ‘আম্‌র ইবনুল ‘আস (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি নাবী(সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছেনঃ তোমরা যখন মুওয়ায্‌যিনকে আযান দিতে শুন, তখন সে যা বলে তোমরা তাই বল। অতঃপর আমার উপর দুরূদ পাঠ কর। কেননা, যে ব্যক্তি আমার ওপর একবার দরূদ পাঠ করে আল্লাহ তা’আলা এর বিনিময়ে তার উপর দশবার রহমাত বর্ষণ করেন। অতঃপর আমার জন্যে আল্লাহর কাছে ওয়াসীলাহ্‌ প্রার্থনা কর। কেননা, ‘ওয়াসীলাহ্‌’ জান্নাতের একটি সম্মানজনক স্থান। এটা আল্লাহর বান্দাদের মধ্যে একজনকেই দেয়া হবে। আমি আশা করি, আমিই হব সে বান্দা। যে ব্যক্তি আল্লাহর কাছে আমার জন্যে ওয়াসীলাহ্‌ প্রার্থনা করবে তার জন্যে (আমার) শাফা’আত ওয়াজিব হয়ে যাবে।",
      "numbers": "ই. ফা. ৭৩৩, ই. সে. ৭৪৮",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "9",
      "name": "সা’দ ইবনু আবূ ওয়াক্কাস (রাঃ) থেকে বর্ণিতঃ",
      "description": "রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ মুওয়ায্‌যিনের আযান শুনে যে ব্যক্তি বলে, “আশহাদু আল লা-ইলা-হা ইল্লাল্ল-হু ওয়াহ্‌দাহু, লা-শারীকা লাহু, ওয়া আন্না মুহাম্মাদান ‘আবদুহু, ওয়া রসূলুহু, রাযীতু বিল্লা-হি রব্বান ওয়াবি মুহাম্মাদিন রসূলান ওয়াবিল ইসলা-মী দীনান” তার গুনাহ মাফ করা হবে। কুতাইবাহ্‌ তার হাদীসে (আরবী) শব্দটি উল্লেখ করেননি। ",
      "numbers": "ই. ফা. ৭৩৫, ই. সে. ৭৫০",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "10",
      "name": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ মুওয়ায্‌যিন যখন আযান দেয় তখন শাইতান পিছন ঘুরে বায়ু ছাড়তে ছাড়তে তাড়াতাড়ি পালিয়ে যায়।",
      "numbers": "ই. ফা. ৭৪১, ই. সে. ৭৫৪",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "11",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "“প্রত্যেক ইফতারের সময় জাহান্নাম থেকে আল্লাহর কিছু মুক্তি প্রাপ্ত বান্দা থাকে।”",
      "numbers": "তানজিহুশ শারিয়াহ” লিল কিনানি: (২/১৫৫)",
      "grade": "দুর্বল হাদিস"
    },
    {
      "id": "12",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "“এক বেদুঈন নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকট এসে বলেঃ আমি চাঁদ দেখেছি, তিনি বললেনঃ তুমি কি সাক্ষ্য দাও যে, আল্লাহ ব্যতীত কোন ইলাহ নেই, মুহাম্মদ আল্লাহর রাসূল ? সে বললঃ হ্যাঁ, তিনি বললেনঃ হে বেলাল মানুষকে জানিয়ে দাও, তারা যেন আগামী কাল সওম পালন করে।”",
      "numbers": "আবু দাউদ: (২৩৪০), তিরমিযী: (৬৯১)",
      "grade": "দুর্বল হাদিস"
    },
    {
      "id": "13",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "আমের ইব্‌ন মাসউদ নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম থেকে বর্ণনা করেনঃ “শীতকালীন সওম হচ্ছে ঠাণ্ডা গনিমত”। অর্থাৎ কষ্টহীন পূণ্য।",
      "numbers": "ইব্‌ন মাসউদ থেকে আহমদ: (৪/৩৩৫), তিরমিযি: (৭৯৪)",
      "grade": "দুর্বল হাদিস"
    },
    {
      "id": "14",
      "name": "আবূ হুরাইরাহ্‌ (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ তোমাদের কোন লোক হারানো প্রাণী পাওয়ার পর যে সমান আনন্দিত হয়, তোমাদের তাওবার কারণে আল্লাহ তা‘আলা এর চেয়েও বেশি খুশী হন।",
      "numbers": "ই. ফা. ৬৭০১, ই. সে. ৬৭৫৬",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "15",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "উরওয়া ইব্নু যুবাইর (রহঃ) এই আয়াত সম্বন্ধে لَهُمْ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ (তাদের জন্য দুনিয়া ও আখিরাতে সুসংবাদ রয়েছে) বলেন যে, এর অর্থ হল ঐ সমস্ত ভাল স্বপ্ন, যা নেককার মানুষে দেখে কিংবা অপর কেউ তার সম্বন্ধে দেখে। (হাদীসটি ইমাম মালিক এককভাবে বর্ণনা করেছেন)",
      "numbers": "⁉⁉",
      "grade": "নির্ণীত নয়"
    },
    {
      "id": "16",
      "name": "আতা ইব্নু ইয়াসার (রাঃ) থেকে বর্ণিতঃ",
      "description": "রাসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, আমার পরে মুবাশ্শাত (সুসংবাদসমূহ) ব্যতীত নবুয়তের কিছুই অবশিষ্ট থাকবে না। সাহাবীগণ আরয করলেন, ইয়া রসূলাল্লাহ্! মুবাশ্শাত কি? রাসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন, এমন ভাল ও শুভ স্বপ্ন যা কোন নেককার মানুষে দেখে কিংবা অপর কেউ তাঁর (উক্ত নেককার) সম্বন্ধে দেখে। ইহা নবুয়তের ছেচল্লিশ ভাগের এক ভাগ। ",
      "numbers": "বুখারী ৬৯৯০",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "17",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "ধূলিকণা হতে তোমরা বেঁচে চল, কারণ ধূলিকণা হতেই জীবাণু সৃষ্টি হয়।",
      "numbers": "হাদীসটি জাল।",
      "grade": "জাল হাদিস"
    },
    {
      "id": "18",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "দু’টি বস্তুর নিকটবর্তী হয়ো না, আল্লাহর সাথে শরীক স্থাপন করা এবং মানুষের ক্ষতি সাধন করা।",
      "numbers": "হাদীসটি জাল।",
      "grade": "জাল হাদিস"
    },
    {
      "id": "19",
      "name": "বর্ণনাকারী থেকে বর্ণিতঃ",
      "description": "আল্লাহর দুনিয়ার নিকট অহী মারফত বলেছেন যে, তুমি খেদমত কর ঐ বাক্তির যে আমার খেদমত করে আর কষ্ট দাও ঐ বাক্তিকে যে তোমার খেদমত করে।",
      "numbers": "হাদীসটি জাল।",
      "grade": "জাল হাদিস"
    },
    {
      "id": "20",
      "name": "",
      "description": "আমার উম্মতের দু’শ্রেণীর লোক যখন ঠিক হয়ে যাবে, তখন মানুষ ভাল হয়ে যাবে। নেতাগণ এবং ফাকীহ্‌গণ। (অন্য বর্ণনায় এসেছে ‘আলেমগন’)।",
      "numbers": "হাদীসটি জাল।",
      "grade": "জাল হাদিস"
    },
    {
      "id": "21",
      "name": "আ’মাশ (রহঃ) থেকে বর্ণিতঃ",
      "description": "রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম) বলেছেন, ভুলে যাওয়া হচ্ছে ইলমের পক্ষে আপদস্বরূপ। ইলমকে নষ্ট করা হচ্ছে অনুপযুক্ত লোককে বলা।",
      "numbers": "বর্ণনাটি জাল।",
      "grade": "জাল হাদিস"
    },
    {
      "id": "22",
      "name": "সুফিয়ান ছাওরী থেকে বর্ণিতঃ",
      "description": "ওমর (রাঃ) একদা কা’বকে বললেন, প্রকৃত আলেম কারা? তিনি বললেন, যারা ইলম অনুযায়ী আমল করে। তিনি পুনরায় বলেন, কোন জিনিষ আলেমদের অন্তর হতে ইলম বের করে দেয়? তিনি বললেন, লোভ।",
      "numbers": "দারেমী হা/৫৯৫; মিশকাত হা/২৬৬",
      "grade": "দুর্বল হাদিস"
    },
    {
      "id": "23",
      "name": "আবদুল্লাহ ইবনু মাসউদ (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, কোন এক সময় রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর সাথে আমরা বের হলাম। আমরা ছিলাম যুবক। (বিয়ের খরচ বহনের) আমাদের আর্থিক সামর্থ্য ছিল না। তিনি বললেনঃ হে যুব সমাজ। তোমাদের বিয়ে করা উচিত। কেননা, এটা দৃষ্টিকে সংযত রাখে এবং লজ্জাস্থানকে সুরক্ষিত রাখে। আর তোমাদের যে লোকের বিয়ের সামর্থ্য নেই সে লোক যেন রোযা আদায় করে। কেননা, তার যৌনশক্তিকে এটা নিয়ন্ত্রণে রাখবে।",
      "numbers": "ইবনু মা-জাহ (১৮৪৫), বুখারী, মুসলিম",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "24",
      "name": "জাবির (রাঃ) থেকে বর্ণিতঃ",
      "description": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ মহিলাদেরকে বিয়ে করা হয় তাদের দীনদারী, ধন-সম্পদ ও সৌন্দর্য দেখে। অবশ্যই তুমি দীনদার পাত্রীকে বেশি অগ্রাধিকার দিবে; কল্যাণে তোমার হাত পরিপূর্ণ হবে। ",
      "numbers": "ইবনু মা-জাহ (১৮৫৮), বুখারী ও মুসলিম",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "25",
      "name": "মুগীরা ইবনু শুবা (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি এক মহিলার নিকট বিয়ের প্রস্তাব প্রেরণ করেন। নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ তাকে দেখে নাও, তোমাদের মধ্যে এটা ভালবাসার সৃষ্টি করবে।",
      "numbers": "ইবনু মা-জাহ (১৮৬৫)",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "26",
      "name": "মুহাম্মাদ ইবনু হাতিব আল-জুমাহী (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ দফ বাজানো ও ঘোষণা দেয়া হচ্ছে (বিয়েতে) হালাল ও হারামের পার্থক্য।",
      "numbers": "ইবনু মা-জাহ (১৮৯৬)",
      "grade": "হাসান হাদিস"
    },
    {
      "id": "27",
      "name": "আবু হুরাইরা (রাঃ) থেকে বর্ণিতঃ",
      "description": "যখন কোন লোক বিয়ে করত, তখন তার জন্য রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এই দু’আ পাঠ করতেনঃ 'বারাকাল্লাহু লাকা ওয়া বারাকা আলাইকা ওয়া জামাআ বাইনাকুমা ফিল খাইরি'। অর্থঃ আল্লাহ তা'আলা তোমার জীবন বারকাতময় করুন আর তোমাদেরকে কল্যাণের মধ্যে একত্রিত করুন।",
      "numbers": "ইবনু মা-জাহ (২৯০৫)",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "28",
      "name": "আবু হুরাইরা (রাঃ) থেকে বর্ণিতঃ",
      "description": "তিনি বলেন, সাহাবীগণ জিজ্ঞেস করেন, ইয়া রাসূলাল্লাহ! কার সাথে সদাচরণ করবো? তিনি বলেনঃ তোমার মায়ের সাথে। তারা বলেন, অতঃপর কার সাথে? তিনি বলেনঃ তোমার পিতার সাথে। তিনি বলেন, অতঃপর কার সাথে? তিনি বলেন, অতঃপর পর্যায়ক্রমে নিকটবর্তীদের সাথে।",
      "numbers": "বুখারী ৫৯৭১, মুসলিম ৪৬২১",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "29",
      "name": "মিকদাম বিন মা‘দীকারিব (রাঃ) থেকে বর্ণিতঃ",
      "description": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ নিশ্চয় আল্লাহ তাআলা তোমাদের মায়েদের সম্পর্কে তোমাদের উপদেশ দিচ্ছেন। একথা তিনি তিনবার বলেনঃ নিশ্চয় আল্লাহ তোমাদের পিতাদের সম্পর্কে উপদেশ দিচ্ছেন। নিশ্চয় আল্লাহ পর্যায়ক্রমে তোমাদের নিকটবর্তীদের সম্পর্কে তোমাদের উপদেশ দিচ্ছেন (সদাচারের)। ",
      "numbers": "আহমাদ ১৬৭৩৩,১৬৭৩৬",
      "grade": "সহিহ হাদিস"
    },
    {
      "id": "30",
      "name": "আবূ উমামাহ (রাঃ) থেকে বর্ণিতঃ",
      "description": "এক ব্যক্তি বললো, হে আল্লাহর রাসূল! সন্তানের উপর মাতা-পিতার কী অধিকার আছে? তিনি বলেনঃ তারা তোমার জান্নাত এবং তোমার জাহান্নাম।",
      "numbers": "মিশকাত ৪৯৪১, আর রাদ্দু আলাল বালীক ১২২",
      "grade": "দুর্বল হাদিস"
    }
  ]
}
